app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'GET') {
            return view('auth/login');
        }

        if ($this->request->getMethod() === 'POST') {
            if (!$this->validate([
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]'
            ])) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            $userModel = new UserModel();
            $email     = $this->request->getPost('email');
            $password  = $this->request->getPost('password');
            $user      = $userModel->findUserByEmail($email);
---
SELECT *
FROM `users`
WHERE `email` = 'josh22@gmail.com'
 LIMIT 1

    public function dashboard()
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return redirect()->to('/auth/login')->with('error', 'Please login first.');
        }

        $db        = \Config\Database::connect();
        $userModel = new UserModel();

        $userId   = $session->get('user_id');
        $userRole = strtolower($session->get('user_role'));
        $user     = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'