app/Controllers/Auth.php

    public function handleLogin()
    {
        helper(['form']);
        $session   = session();
        $userModel = new UserModel();

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return view('auth/login', ['validation' => $this->validator]);
        }

        $user = $userModel->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student@lms.com'
 LIMIT 1